{"keras_version": "1.2.1", "config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3], "trainable": true, "function_type": "lambda", "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "nb_row": 5, "W_regularizer": null, "bias": true, "name": "convolution2d_1", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 25, "nb_col": 5, "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_row": 5, "W_regularizer": null, "bias": true, "name": "convolution2d_2", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "nb_col": 5, "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_row": 5, "W_regularizer": null, "bias": true, "name": "convolution2d_3", "activation": "linear", "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "nb_col": 5, "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_row": 3, "W_regularizer": null, "bias": true, "name": "convolution2d_4", "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_row": 3, "W_regularizer": null, "bias": true, "name": "convolution2d_5", "activation": "linear", "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 50, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "input_dim": 1152, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"output_dim": 10, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "input_dim": 50, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "input_dim": 10, "trainable": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}