{"keras_version": "1.2.1", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "output_shape_type": "raw", "output_shape": [66, 200, 3], "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 25, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "subsample": [2, 2], "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 36, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "subsample": [2, 2], "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 48, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "subsample": [2, 2], "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_5", "subsample": [1, 1], "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "input_dim": 1152, "activation": "linear", "name": "dense_1", "bias": true, "init": "glorot_uniform", "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "input_dim": 100, "activation": "linear", "name": "dense_2", "bias": true, "init": "glorot_uniform", "output_dim": 50, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "input_dim": 50, "activation": "linear", "name": "dense_3", "bias": true, "init": "glorot_uniform", "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "input_dim": 10, "activation": "linear", "name": "dense_4", "bias": true, "init": "glorot_uniform", "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}