{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "trainable": true, "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "nb_row": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "nb_filter": 25, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "nb_row": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "nb_row": 5, "subsample": [2, 2], "b_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_3", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_4", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "dim_ordering": "tf", "bias": true, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "b_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "output_dim": 100, "W_constraint": null, "name": "dense_1", "input_dim": 1152, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_6", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "output_dim": 50, "W_constraint": null, "name": "dense_2", "input_dim": 100, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_7", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "output_dim": 10, "W_constraint": null, "name": "dense_3", "input_dim": 50, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "output_dim": 1, "W_constraint": null, "name": "dense_4", "input_dim": 10, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}