{"config": [{"config": {"arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "trainable": true, "output_shape": [66, 200, 3]}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_filter": 25, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_filter": 36, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 5, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_filter": 48, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "bias": true, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_row": 3, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "bias": true, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "nb_row": 3, "trainable": true, "W_regularizer": null, "activation": "linear", "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "bias": true, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 1152, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 100, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 50, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "input_dim": 10, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}