{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "name": "lambda_1", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>7\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape": [66, 200, 3]}, "class_name": "Lambda"}, {"config": {"name": "convolution2d_1", "b_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 5, "activation": "linear", "nb_filter": 25, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "b_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 5, "activation": "linear", "nb_filter": 36, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "b_regularizer": null, "trainable": true, "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 5, "activation": "linear", "nb_filter": 48, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_4", "b_regularizer": null, "trainable": true, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_5", "b_regularizer": null, "trainable": true, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_1", "input_dim": 1152, "b_constraint": null, "activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 50, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "input_dim": 50, "b_constraint": null, "activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_3", "input_dim": 10, "b_constraint": null, "activity_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}