{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>8\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 25, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 36, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 48, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 1152, "W_constraint": null, "b_constraint": null, "batch_input_shape": [null, 1152], "trainable": true, "output_dim": 100, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 100, "W_constraint": null, "b_constraint": null, "batch_input_shape": [null, 100], "trainable": true, "output_dim": 50, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 50, "W_constraint": null, "b_constraint": null, "batch_input_shape": [null, 50], "trainable": true, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 10, "W_constraint": null, "b_constraint": null, "batch_input_shape": [null, 10], "trainable": true, "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32"}}], "keras_version": "1.2.1"}