{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "output_shape": [66, 200, 3], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "nb_filter": 25, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "nb_filter": 36, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "dim_ordering": "tf", "W_constraint": null, "subsample": [2, 2], "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "nb_filter": 48, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "dim_ordering": "tf", "W_constraint": null, "subsample": [1, 1], "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 1152, "b_regularizer": null, "output_dim": 100, "activation": "linear", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 100, "b_regularizer": null, "output_dim": 50, "activation": "linear", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 50, "b_regularizer": null, "output_dim": 10, "activation": "linear", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "input_dim": 10, "b_regularizer": null, "output_dim": 1, "activation": "linear", "trainable": true}}]}